export const termsContent = {
    terms:
`제1조(목적)

이 약관은 Tasteholic(전자상거래 사업자)이 운영하는 
Tasteholic 사이버 몰(이하 “Tasteholic”이라 한다)에서 제공하는 인터넷 관련 서비스(이하 “서비스”라 한다)를 이용함에 있어 Tasteholic과 이용자의 권리․의무 및 책임사항을 규정함을 목적으로 합니다.
※「PC통신, 무선 등을 이용하는 전자상거래에 대해서도 그 성질에 반하지 않는 한 이 약관을 준용합니다.」

제2조(정의)

① “Tasteholic”이란 Tasteholic이 재화 또는 용역(이하 “재화 등”이라 함)을 이용자에게 제공하기 위하여 컴퓨터 등 정보통신설비를 이용하여 재화 등을 거래할 수 있도록 설정한 가상의 영업장을 말하며, 아울러 사이버몰을 운영하는 사업자의 의미로도 사용합니다.
② “이용자”란 “Tasteholic”에 접속하여 이 약관에 따라 “Tasteholic”이 제공하는 서비스를 받는 회원 및 비회원을 말합니다.
③ ‘회원’이라 함은 “Tasteholic”에 회원등록을 한 자로서, 계속적으로 “Tasteholic”이 제공하는 서비스를 이용할 수 있는 자를 말합니다.
④ ‘비회원’이라 함은 회원에 가입하지 않고 “Tasteholic”이 제공하는 서비스를 이용하는 자를 말합니다.

제3조 (약관 등의 명시와 설명 및 개정)

① “Tasteholic”은 이 약관의 내용과 상호 및 대표자 성명, 영업소 소재지 주소(소비자의 불만을 처리할 수 있는 곳의 주소를 포함), 전화번호․모사전송번호․전자우편주소, 사업자등록번호, 통신판매업 신고번호, 개인정보관리책임자 등을 이용자가 쉽게 알 수 있도록 Tasteholic의 초기 서비스화면(전면)에 게시합니다. 다만, 약관의 내용은 이용자가 연결화면을 통하여 볼 수 있도록 할 수 있습니다.
② “Tasteholic”은 이용자가 약관에 동의하기에 앞서 약관에 정하여져 있는 내용 중 청약철회․배송책임․환불조건 등과 같은 중요한 내용을 이용자가 이해할 수 있도록 별도의 연결화면 또는 팝업화면 등을 제공하여 이용자의 확인을 구하여야 합니다.
③ “Tasteholic”은 「전자상거래 등에서의 소비자보호에 관한 법률」, 「약관의 규제에 관한 법률」 등 관련 법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
④ “Tasteholic”이 약관을 개정할 경우, 적용일자 및 개정사유를 명시하여 최소 7일 이전에 공지합니다.

제4조(서비스의 제공 및 변경)

① “Tasteholic”은 다음과 같은 업무를 수행합니다.
 1. 재화 또는 용역에 대한 정보 제공 및 구매계약의 체결
 2. 구매계약이 체결된 재화 또는 용역의 배송
 3. 기타 “Tasteholic”이 정하는 업무

② “Tasteholic”은 재화의 품절, 기술적 사양 변경 등의 사유로 장차 체결될 계약을 변경할 수 있습니다.

제5조(서비스의 중단)

① “Tasteholic”은 컴퓨터 등 정보통신설비의 보수점검 및 고장 등의 사유로 서비스를 일시적으로 중단할 수 있습니다.
② “Tasteholic”은 서비스 중단으로 인해 이용자가 입은 손해에 대해 배상합니다. 다만, 고의 또는 과실이 없는 경우에는 그러하지 않습니다.

제6조(회원가입)

① 이용자는 “Tasteholic”의 가입 양식에 따라 회원정보를 기입하고 약관에 동의함으로써 회원가입을 신청합니다.
② “Tasteholic”은 회원가입 신청을 승낙할 수 있으며, 다음 각 호에 해당하지 않는 한 등록을 완료합니다.

제7조(회원 탈퇴 및 자격 상실 등)

① 회원은 언제든지 “Tasteholic”에 탈퇴를 요청할 수 있으며, “Tasteholic”은 즉시 회원탈퇴를 처리합니다.
② “Tasteholic”은 회원이 다음 각 호에 해당하는 경우 회원자격을 제한 및 정지시킬 수 있습니다.

제8조(회원에 대한 통지)

① “Tasteholic”은 회원에게 전자우편 등을 이용하여 고지할 수 있습니다.
② 불특정다수에 대한 통지는 1주일 이상 “Tasteholic” 게시판에 게시함으로써 갈음할 수 있습니다.

제9조(구매신청)

① “Tasteholic” 이용자는 다음과 같은 절차에 따라 구매를 신청할 수 있습니다.
 1. 재화 등의 검색 및 선택
 2. 배송지 정보 입력
 3. 결제 방법 선택 및 확인

제10조(계약의 성립)

① “Tasteholic”은 다음과 같은 사유가 있는 경우 구매신청을 승낙하지 않을 수 있습니다.
 1. 신청 내용에 허위가 포함된 경우
 2. 미성년자가 법정대리인의 동의 없이 거래를 시도하는 경우

제11조(지급방법)

“Tasteholic”에서 구매한 재화의 결제 방식은 다음과 같습니다.
• 계좌이체, 신용카드, 무통장입금, 전자화폐, 포인트 결제 등

제12조(수신확인통지․구매신청 변경 및 취소)

“Tasteholic”은 이용자의 구매 신청 시 수신확인을 진행하고, 이후 계약이 체결됩니다.

제13조(재화 등의 공급)

“Tasteholic”은 구매일로부터 7일 이내에 재화를 배송하기 위해 최선을 다합니다.

제17조(개인정보보호)

“Tasteholic”은 개인정보를 수집 시 필요한 최소한의 정보만 수집합니다.

제18조(“Tasteholic”의 의무)

“Tasteholic”은 법령과 약관을 준수하고, 안정적으로 서비스를 제공할 의무가 있습니다.

제19조(회원의 ID 및 비밀번호에 대한 의무)

회원은 자신의 ID와 비밀번호를 안전하게 관리해야 합니다.

제20조(이용자의 의무)

이용자는 다음의 행위를 해서는 안 됩니다.
 • 허위 정보 제공, 타인의 정보 도용, 지적재산권 침해 등

제22조(저작권의 귀속 및 이용제한)

“Tasteholic”이 작성한 저작물의 저작권은 “Tasteholic”에 귀속됩니다.

제24조(재판권 및 준거법)

“Tasteholic”과 이용자 간의 소송은 이용자의 주소를 관할하는 법원에 제기합니다.`,
    privacy: 
`1. 수집하는 개인정보 항목

Tasteholic은 회원 가입 시 다음과 같은 최소한의 개인정보를 수집합니다.
 • 아이디: 회원의 고유 식별 및 서비스 이용을 위한 로그인 식별자로 사용됩니다.
 • 비밀번호: 계정 보안을 위한 인증 수단으로 사용됩니다.

2. 개인정보 수집 및 이용 목적

Tasteholic은 수집한 개인정보를 다음과 같은 목적으로 이용합니다.
 • 회원 가입 및 서비스 제공을 위한 본인 확인
 • 서비스 내 개인 맞춤형 콘텐츠 제공 및 계정 관리
 • 고객 문의 및 민원 처리
 • 부정 이용 방지 및 보안 강화

3. 개인정보 보유 및 이용 기간

Tasteholic은 개인정보 수집 및 이용 목적이 달성된 후 해당 정보를 지체 없이 파기합니다. 단, 관계 법령에 의해 일정 기간 보관해야 하는 경우는 아래와 같습니다.
 • 회원 가입 정보: 회원 탈퇴 시까지 보유
 • 관련 법령에 의한 보존: 전자상거래 등에서의 소비자보호에 관한 법률에 따라 보관

4. 동의를 거부할 권리 및 미동의 시 불이익

이용자는 개인정보 수집 및 이용에 대한 동의를 거부할 수 있습니다. 다만, 필수 정보 미동의 시 Tasteholic의 회원가입 및 서비스 이용이 제한될 수 있습니다.

5. 개인정보 관리 책임자 및 문의처

 • 개인정보 관리 책임자: []
 • 이메일: []
 • 전화번호: []  `,
    optional: 
`1. 수집하는 개인정보 선택 항목
 • 닉네임

2. 수집하는 개인정보 이용 목적
 • 서비스 내 사용자 식별 및 개인화된 경험 제공
 • 레시피 작성 시 닉네임 노출

3. 개인정보 보유 및 이용기간
 • 최종 로그인 후 2년 경과 시, 혹은 정보주체의 회원 탈퇴 신청 시 즉시 파기

4. 동의 거부 권리 사실 및 불이익 내용
 • 이용자는 동의를 거부할 권리가 있습니다.
 • 선택사항에 동의하지 않아도 회원가입 및 서비스 이용이 가능합니다.`,
  };
  